import { Timeline } from "@shared/types/timeline";

export const MOCK_TIMELINE: Timeline = [
  {
    id: "1",
    category: "Кино",
    events: [
      {
        id: "1",
        date: "1927-01-01",
        description: "Выход первого звукового фильма 'Певец джаза' (The Jazz Singer)",
      },
      {
        id: "2",
        date: "1939-01-01",
        description: "Премьера фильма 'Унесённые ветром', ставшего классикой мирового кинематографа",
      },
      {
        id: "3",
        date: "1977-01-01",
        description: "Выход первого эпизода 'Звёздных войн', революционна в области спецэффектов",
      },
      {
        id: "4",
        date: "1995-01-01",
        description: "Выход 'Истории игрушек' - первого полнометражного компьютерного анимационного фильма",
      },
      {
        id: "5",
        date: "2009-01-01",
        description: "Премьера фильма 'Аватар', установившего новые стандарты 3D-технологий в кино",
      }
    ],
  },
  {
    id: "2",
    category: "Литература",
    events: [
      {
        id: "1",
        date: "1929-01-01",
        description: "Эрнест Хемингуэй публикует роман 'Прощай, оружие!'",
      },
      {
        id: "2",
        date: "1947-01-01",
        description: "Публикация 'Дневника Анны Франк', ставшего символом жертв Холокоста",
      },
      {
        id: "3",
        date: "1957-01-01",
        description: "Борис Пастернак получает Нобелевскую премию за роман 'Доктор Живаго'",
      },
      {
        id: "4",
        date: "1997-01-01",
        description: "Выход первой книги о Гарри Поттере 'Философский камень'",
      },
      {
        id: "5",
        date: "2006-01-01",
        description: "Орхан Памук получает Нобелевскую премию по литературе",
      }
    ],
  },
  {
    id: "3",
    category: "Игры",
    events: [
      {
        id: "1",
        date: "1972-01-01",
        description: "Выпуск игры Pong - первой коммерчески успешной видеоигры",
      },
      {
        id: "2",
        date: "1985-01-01",
        description: "Выход консоли Nintendo Entertainment System (NES) и игры Super Mario Bros",
      },
      {
        id: "3",
        date: "1996-01-01",
        description: "Появление Pokemon Red и Blue, начало феномена Pokemon",
      },
      {
        id: "4",
        date: "2004-01-01",
        description: "Запуск World of Warcraft, определившей развитие MMORPG",
      },
      {
        id: "5",
        date: "2011-01-01",
        description: "Выход Minecraft, ставшей самой продаваемой видеоигрой всех времён",
      }
    ],
  },
  {
    id: "4",
    category: "Наука",
    events: [
      {
        id: "1",
        date: "1905-01-01",
        description: "Альберт Эйнштейн публикует специальную теорию относительности",
      },
      {
        id: "2",
        date: "1953-01-01",
        description: "Джеймс Уотсон и Фрэнсис Крик открывают структуру ДНК",
      },
      {
        id: "3",
        date: "1969-01-01",
        description: "Первая высадка человека на Луну - миссия Apollo 11",
      },
      {
        id: "4",
        date: "1990-01-01",
        description: "Запуск космического телескопа Хаббл",
      },
      {
        id: "5",
        date: "2012-01-01",
        description: "Открытие бозона Хиггса в ЦЕРНе",
      }
    ],
  },
  {
    id: "5",
    category: "Спорт",
    events: [
      {
        id: "1",
        date: "1936-01-01",
        description: "Джесси Оуэнс выигрывает 4 золотые медали на Олимпийских играх в Берлине",
      },
      {
        id: "2",
        date: "1980-01-01",
        description: "Олимпийские игры в Москве - первая Олимпиада в СССР",
      },
      {
        id: "3",
        date: "1992-01-01",
        description: "Американская 'Dream Team' по баскетболу на Олимпиаде в Барселоне",
      },
      {
        id: "4",
        date: "2008-01-01",
        description: "Усэйн Болт устанавливает мировой рекорд в беге на 100 метров",
      },
      {
        id: "5",
        date: "2018-01-01",
        description: "Чемпионат мира по футболу в России",
      }
    ],
  },
  {
    id: "6",
    category: "Технологии",
    events: [
      {
        id: "1",
        date: "1947-01-01",
        description: "Создание первого транзистора в Bell Labs",
      },
      {
        id: "2",
        date: "1969-01-01",
        description: "Создание ARPANET - предшественника современного интернета",
      },
      {
        id: "3",
        date: "1981-01-01",
        description: "IBM выпускает первый персональный компьютер",
      },
      {
        id: "4",
        date: "2007-01-01",
        description: "Презентация первого iPhone, революция в мире смартфонов",
      },
      {
        id: "5",
        date: "2011-01-01",
        description: "Watson от IBM побеждает чемпионов в игре Jeopardy!, демонстрируя возможности ИИ",
      }
    ],
  }
];


export const MOCK_TIMELINE_VARIANTS: { [key: string]: Timeline } = {
  "2": MOCK_TIMELINE.slice(0, 2),
  "3": MOCK_TIMELINE.slice(0, 3),
  "4": MOCK_TIMELINE.slice(0, 4),
  "5": MOCK_TIMELINE.slice(0, 5),
  "6": MOCK_TIMELINE,
};